---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateBoolean(System.Boolean)
source: html/819f1cba-ab3c-9572-1efa-8b4663b15655.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateBoolean Method

Creates a boolean data object.

## Syntax (C#)
```csharp
public static IFCData CreateBoolean(
	bool value
)
```

## Parameters
- **value** (`System.Boolean`) - The boolean value.

## Returns
The IFCData object.